<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Docker Toolbox and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.universalrobots.mac.munki.DockerToolbox</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/DockerToolbox</string>
		<key>NAME</key>
		<string>DockerToolbox</string>
		<key>pathname</key>
		<string>%pathname%</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Docker Quickstart Terminal.app</string>
				<string>Kitematic (Beta).app</string>
				<string>Kitematic.app</string>
				<string>VirtualBox.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>The Docker Toolbox installs everything you need to get started with Docker on Mac OS X.</string>
			<key>developer</key>
			<string>Docker, Inc.</string>
			<key>MUNKI_CATEGORY</key>
            <string>Virtualization</string>
			<key>display_name</key>
			<string>DockerToolbox</string>
			<key>minimum_os_version</key>
			<string>10.8</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>com.universalrobots.mac.download.DockerToolbox</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
