<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads the current release version of JetBrains Rider and imports into Munki.</string>
  <key>Identifier</key>
  <string>com.universalrobots.mac.munki.Rider</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>Rider</string>
    <key>MUNKI_REPO_SUBDIR</key>
    <string>apps/JetBrains/Rider</string>
    <key>MUNKI_CATEGORY</key>
    <string>Developer Tools</string>
    <key>pkginfo</key>
    <dict>
      <key>catalogs</key>
      <array>
        <string>testing</string>
      </array>
      <key>category</key>
      <string>%MUNKI_CATEGORY%</string>
      <key>description</key>
      <string>JetBrains Rider is a cross-platform .NET IDE based on the IntelliJ platform and ReSharper.</string>
      <key>developer</key>
      <string>JetBrains</string>
      <key>display_name</key>
      <string>Rider</string>
      <key>name</key>
      <string>%NAME%</string>
      <key>unattended_install</key>
      <true/>
    </dict>
  </dict>
  <key>MinimumVersion</key>
  <string>0.2.9</string>
  <key>ParentRecipe</key>
  <string>com.universalrobots.mac.download.Rider</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>MunkiImporter</string>
      <key>Arguments</key>
      <dict>
        <key>munkiimport_appname</key>
        <string>Rider.app</string>
        <key>pkg_path</key>
        <string>%pathname%</string>
        <key>repo_subdirectory</key>
        <string>%MUNKI_REPO_SUBDIR%</string>
      </dict>
    </dict>
  </array>
</dict>
</plist>