<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest release of JetBrains Rider</string>
    <key>Identifier</key>
    <string>com.universalrobots.mac.download.Rider</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>RIDER</string>
        <key>PLATFORM</key>
        <string>mac</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>JetbrainsURLProvider</string>
            <key>Arguments</key>
            <dict>
                <key>product_code</key>
                <string>RD</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
            </dict>
            <key>Processor</key>
            <string>AppDmgVersioner</string>
        </dict>

    </array>
</dict>
</plist>