<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Identifier</key>
		<string>com.universalrobots.mac.munki.VirtualboxExtpack</string>
		<key>Description</key>
		<string>Downloads VirtualBox and imports into Munki.</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>VirtualBoxExtPack</string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/VirtualBox</string>
			<key>MUNKI_CATEGORY</key>
			<string>Virtualization</string>
			<key>pkginfo</key>
			<dict>
				<key>name</key>
				<string>%NAME%</string>
				<key>display_name</key>
				<string>VirtualBox Extension Pack</string>
				<key>category</key>
				<string>%MUNKI_CATEGORY%</string>
				<key>developer</key>
				<string>Oracle</string>
				<key>description</key>
				<string>Oracle VirtualBox Extension Pack: Support for USB 2.0 devices, VirtualBox RDP and PXE boot for Intel cards.</string>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>unattended_install</key>
				<true/>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.4</string>
		<key>ParentRecipe</key>
		<string>com.universalrobots.mac.download.VirtualboxExtpack</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://www.virtualbox.org/wiki/Downloads/</string>
					<key>re_pattern</key>
					<string>https://download.virtualbox.org/virtualbox/([0-9\.]+)/VirtualBox-[0-9\.]+-[0-999999\.]+-OSX.dmg</string>
					<key>result_output_var_name</key>
					<string>virtualbox_version</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>DmgCreator</string>
				<key>Arguments</key>
				<dict>
					<key>dmg_root</key>
					<string>%pathname%</string>
					<key>dmg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
				<key>Arguments</key>
				<dict>
					<key>additional_pkginfo</key>
					<dict>
						<key>installcheck_script</key>
						<string>#!/bin/sh

VBM=/usr/local/bin/VBoxManage

if [ ! -f $VBM ]
then
	echo 'VBoxManage not present'
	exit 0
fi

extpackoutput=`mktemp -t extpack`

$VBM list extpacks | /usr/bin/grep -A 1 'Oracle VM VirtualBox Extension Pack' \
	&gt; "$extpackoutput"

if [ $? -ne 0 ]
then
	echo "No Extension Pack found in output of $VBM list extpacks"

	rm -f "$extpackoutput"
	exit 0
fi

installedver=`cat "$extpackoutput" | /usr/bin/tail -1 | /usr/bin/awk '{print $2}'`

rm -f "$extpackoutput"

if [ "x$installedver" != "x%virtualbox_version%" ]
then
	echo "Version mismatch of installed version ($installedver) and expected (%virtualbox_version%)"
	exit 0
fi

echo 'Extension pack versions appear to match'
exit 1</string>
						<key>postinstall_script</key>
						<string>#!/bin/sh

VBM=/usr/local/bin/VBoxManage

if [ ! -f $VBM ]
then
	echo 'VBoxManage not present'
	exit 1
fi

echo y | $VBM extpack install --replace \
	/tmp/Oracle_VM_VirtualBox_Extension_Pack.vbox-extpack

exit $?
</string>
						<key>version</key>
						<string>%virtualbox_version%</string>
						<key>update_for</key>
						<array>
							<string>VirtualBox</string>
						</array>
						<key>requires</key>
						<array>
							<string>VirtualBox-%virtualbox_version%</string>
						</array>
					</dict>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
				<key>Arguments</key>
				<dict>
					<key>additional_makepkginfo_options</key>
					<array>
						<string>-i</string>
						<string>Oracle_VM_VirtualBox_Extension_Pack.vbox-extpack</string>
						<string>--destinationpath</string>
						<string>/tmp</string>
					</array>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
